[
  {
    "id": "1",
    "title": "First Jagrukta Diwas",
    "description": "Cyber Awareness Program on cyber crimes",
    "content": "On 3rd September 2024, we successfully conducted our first Cyber Jagrukta Diwas, an initiative to raise awareness about essential cybersecurity issues. The event focused on educating participants about the growing threats in the digital world and how to stay protected. The key topics covered during the session were Loan App Scams, Women Security Measures, SOS Applications, Cyber Crime Reporting, and Security in Daily Life.\n\nLoan App Scams – Understanding Digital Fraud\nWith the rise of online lending platforms, fraudulent loan apps have become a major concern. Our session educated attendees on how scammers lure victims into taking instant loans with hidden charges, high-interest rates, and threats for repayment. We highlighted ways to identify fake loan apps, the importance of verifying financial services through official regulatory bodies, and steps to take if trapped in such scams.\n\nWomen Security Measures – Ensuring Digital & Physical Safety\nWomen’s safety, both online and offline, was a key focus of our event. We discussed methods to protect personal data, avoid cyberstalking, and handle social media harassment. The session also covered self-defense apps, privacy settings on social media, and reporting cyber harassment to law enforcement. The goal was to empower women with knowledge and tools to safeguard themselves in the digital world.\n\nSOS Applications – Emergency Support at Your Fingertips\nIn emergencies, quick access to help can be life-saving. We introduced SOS applications that allow users to send alerts to family, friends, and authorities with just a click. Apps like 112 India, CitizenCOP, and My Safetipin were highlighted for their real-time tracking, emergency calling, and location-sharing features. Practical demonstrations helped participants understand how to configure and use these apps effectively.\n\nCyber Crime Reporting – Taking Action Against Online Threats\nMany cybercrimes go unreported due to a lack of awareness. Our session focused on the National Cyber Crime Reporting Portal (www.cybercrime.gov.in), where victims can report cyber fraud, harassment, and other digital crimes. We explained the legal framework, the role of law enforcement, and the importance of timely reporting to ensure proper action is taken against cybercriminals.\n\nSecurity in Daily Life – Practicing Safe Digital Habits\nCybersecurity isn’t just about responding to threats—it’s about preventing them. We emphasized strong password management, two-factor authentication, secure online transactions, and identifying phishing emails. Participants learned how to recognize fake websites, secure their personal devices, and safely use public Wi-Fi networks. Practical tips on digital hygiene were shared to help integrate cybersecurity into daily routines.\n\nConclusion\nOur first Cyber Jagrukta Diwas was a successful step toward building a more cyber-aware community. The event provided practical knowledge and real-world examples to help participants navigate the digital space securely. We aim to continue organizing such initiatives, spreading awareness, and empowering individuals with cybersecurity skills. Together, we can create a safer digital world!",
    "images": [
      "/blog1-1.jpeg",
      "/blog1-2.jpeg"
    ],
    "author": "CYBER CREW",
    "date": "2024-03-09"
  },
  {
    "id": "2",
    "title": "Second Jagrukta Diwas",
    "description": "Awareness Session on Hardware Hacking",
    "content": "we conducted another awareness session on 1st October 2024, focusing on Hardware Hacking, Hardware Security, Virtualization, Assembling & Disassembling, Flipper Zero & Raspberry Pi, Keyloggers, and Data Breaches. This event aimed to deepen participants' understanding of both hardware and software-based security threats, equipping them with hands-on knowledge to defend against cyber risks.\n\nHardware Hacking & Hardware Security – Understanding the Risks\nWith the increasing use of embedded systems and IoT devices, hardware hacking has become a serious concern. We explored how attackers exploit vulnerabilities in hardware components and the methods to protect devices from unauthorized access. The session also covered BIOS/UEFI security, firmware attacks, and secure boot mechanisms to prevent unauthorized modifications at the hardware level.\n\nVirtualization – Enhancing Security & Efficiency\nVirtualization plays a crucial role in modern computing and cybersecurity. We explained the importance of virtual machines (VMs) and sandboxing for security testing and malware analysis. The session demonstrated how virtualization helps isolate threats, create safe testing environments, and optimize system resources while reducing hardware dependency.\n\nAssembling & Disassembling – Hands-On Hardware Learning\nUnderstanding the internal components of a computer is essential for both troubleshooting and security. Participants learned to assemble and disassemble PCs and laptops, gaining hands-on experience with RAM installation, motherboard connections, power supply configurations, and hardware diagnostics. This practical session enhanced their ability to detect and fix hardware-related vulnerabilities.\n\nFlipper Zero & Raspberry Pi – The Power of Portable Hacking Devices\nThe session introduced Flipper Zero and Raspberry Pi, two versatile tools used for cybersecurity research and penetration testing. We demonstrated how these devices can be used for ethical hacking, network scanning, RFID/NFC cloning, and automation tasks. The discussion also highlighted the ethical boundaries and responsible use of such tools to prevent misuse.\n\nKeyloggers – The Silent Threat to Cybersecurity\nKeyloggers are one of the most dangerous tools used in cyberattacks to steal credentials and sensitive information. We covered the different types of hardware and software keyloggers, their functioning, and real-world case studies of cyber espionage. The session emphasized how to detect, prevent, and remove keyloggers using anti-malware tools, behavioral analysis, and secure authentication methods.\n\nData Breaches – Protecting Sensitive Information\nData breaches have become a major concern in the digital world. We discussed recent high-profile breaches, their impact on individuals and organizations, and the techniques cybercriminals use to steal data through phishing, malware, and weak security configurations. The session concluded with best practices for data protection, encryption, and safe online behavior to prevent unauthorized access to personal and corporate information.\n\nConclusion\nThe 1st October Cyber Jagrukta Diwas successfully provided hands-on knowledge about hardware security, ethical hacking tools, virtualization, and cyber threats. By combining theoretical concepts with real-world demonstrations, participants gained a deeper understanding of cybersecurity risks and defenses. These sessions continue to empower individuals with the skills needed to secure hardware, software, and digital assets in an evolving cyber landscape.",
    "images": [
      "/blog2-1.jpg",
      "/blog2-2.jpg",
      "/blog2-4.jpg"
    ],
    "author": "CYBER CREW",
    "date": "2024-01-10"
  },
  {
    "id": "3",
    "title": "Third Jagrukta Diwas",
    "description": "Social Engineering and its various attack techniques",
    "content": "Continuing our commitment to cybersecurity awareness, we conducted our third Cyber Jagrukta Diwas, focusing entirely on Social Engineering and its various attack techniques. Social engineering remains one of the most dangerous cyber threats, as it exploits human psychology rather than technical vulnerabilities. This session educated participants on the different types of social engineering attacks, real-world case studies, and ways to protect against manipulation tactics used by cybercriminals.\n\nTypes of Social Engineering Attacks\nThe session covered various social engineering techniques used to deceive individuals into revealing sensitive information or performing harmful actions. Some of the key topics included:\n\nPhishing – How attackers use deceptive emails, messages, and fake websites to steal login credentials and financial data.\nVishing & Smishing – The rise of voice phishing (vishing) and SMS-based phishing (smishing) tactics to manipulate victims.\nPretexting – How attackers create fake scenarios to extract information or gain unauthorized access.\nBaiting & Quid Pro Quo Attacks – Tricks involving fake offers, infected USB drives, or fraudulent customer service calls.\nImpersonation & Tailgating – Physical social engineering techniques used to bypass security measures in workplaces.\n\nReal-World Case Studies & Live Demonstrations\nTo make the session more engaging, we analyzed real-world social engineering attacks, including major cybercrimes where human manipulation played a crucial role. A live demonstration showed how a simple phishing attack can compromise an email account, emphasizing the importance of verifying links and sources before clicking.\n\nDefensive Strategies Against Social Engineering\nParticipants learned how to recognize, avoid, and respond to social engineering attempts. Some key defense techniques included:\n\nVerifying sources before sharing sensitive information.\nUsing multi-factor authentication (MFA) to prevent account takeovers.\nDeveloping a habit of questioning suspicious emails, messages, and calls.\nAvoiding oversharing personal information on social media.\nTraining employees and individuals to spot red flags in communication.\n\nConclusion\nOur third Cyber Jagrukta Diwas successfully raised awareness about the psychological manipulation tactics used in cyberattacks. The session provided practical insights into detecting and preventing social engineering scams that target individuals and organizations.",
    "images": [
      "/blog3-1.jpg",
      "/blog3-2.jpg",
      "/blog3-4.jpg"
    ],
    "author": "CYBER CREW",
    "date": "2025-11-11"
  },
  {
    "id": "4",
    "title": "National DFIR Internship",
    "description": "Celebrating the success of Durga Srinivas Kurra and Gayatri Nallana in the National DFIR Internship",
    "content": "We are proud to announce that two of our college's Cyber Crew members, Durga Srinivas Kurra and Gayatri Nallana, have excelled in the prestigious Digital Forensic and Incident Response (DFIR) Internship hosted by IIMT College, Greater Noida, Uttar Pradesh.\n\nThe two-month internship saw the participation of 600 interns from across India, all vying to prove their mettle in the field of digital forensics. Durga Srinivas Kurra and Gayatri Nallana showcased exceptional skills and dedication, earning them a place among the top 20 performers nationwide.\n\nTheir outstanding performance was recognized and honored by several esteemed authorities during the award ceremony held at IIMT College, Greater Noida. This achievement is a testament to their hard work, and it brings immense pride to our institution.\n\nWe congratulate Durga Srinivas Kurra and Gayatri Nallana on this remarkable accomplishment and wish them continued success in their future endeavors.",
    "images": [
      "/blog4-1.jpg",
      "/blog4-2.jpg",
      "/blog4-3.jpg"
    ],
    "author": "CYBER CREW",
    "date": "2024-22-08"
  },
  {
    "id": "5",
    "title": "Anvarkrit 2025 National Crime Scene Investigation Competition",
    "description": "Cyber Crew qualifies for Anvarkrit 2025, a national forensic competition at NFSU Delhi",
    "content": "We are thrilled to share that our college’s Cyber Crew has qualified for the Anvarkrit 2025 National Crime Scene Investigation Competition (NCSIC), to be held at the National Forensic Sciences University (NFSU), Delhi, from December 26, 2024, to January 16, 2025. This prestigious national-level event invites students to tackle real-world criminal scenarios through quizzes, digital poster presentations, and hands-on crime scene investigations, fostering analytical skills, teamwork, and a passion for forensic science careers.\n\nThe National Forensic Sciences University (NFSU), an Institution of National Importance, is the world’s first university dedicated solely to forensic sciences, cybersecurity, digital forensics, and behavioral sciences. Participating in Anvarkrit at NFSU offers our team access to unparalleled expertise and cutting-edge forensic tools, serving as a launchpad for careers in digital forensics and cybersecurity.\n\nOur team’s journey to Anvarkrit 2025 is a testament to our dedication and skill. Competing against thousands of students nationwide, we secured one of only 2000 slots for the offline workshop and Round 4 of this highly competitive event. This achievement reflects the guidance of our mentor, Somesh Sir, and our collective efforts in mastering cyber forensics and crime scene management.\n\nThrough rigorous preparation, we’ve honed skills critical to modern criminal investigations, including evidence analysis and digital forensics techniques. Attending Anvarkrit will allow us to apply this knowledge practically, learn from forensic experts, and network with peers, opening doors to significant opportunities in cybersecurity and forensics.\n\nWe are immensely proud of this milestone and excited to represent our college at Anvarkrit 2025, where we aim to further our expertise and contribute to the field of forensic science.",
    "images": [
      "/blog5-1.jpg",
      "/blog5-2.jpg"
    ],
    "author": "CYBER CREW",
    "date": "2024-12-26"
  },
  {
    "id": "6",
    "title": "A Transformative Journey at APDTS 2025",
    "description": "M Gowtham Satya Sai’s experience at the Andhra Pradesh Digital Technology Summit 2025",
    "content": "M Gowtham Satya Sai had the incredible opportunity to attend the Andhra Pradesh Digital Technology Summit (APDTS) 2025, held on the 8th and 9th of January. The event served as a vibrant hub for thought leaders, IT professionals, startup innovators, and aspiring technologists to come together and explore the frontiers of AI, cybersecurity, and digital transformation.\n\nOne of the most impactful moments for Gowtham was engaging with Mr. Akhilesh Tuteja, Global Head – Cyber Security Consulting and India Head – Clients & Industries at KPMG. His visionary perspective on the evolving landscape of cybersecurity provided deep inspiration.\n\nAdditionally, connecting with Ms. Vandana Verma, Security Relations Leader at Snyk, offered valuable insights into application security. Their conversation fostered a deeper understanding of the importance of securing modern software ecosystems.\n\nGowtham also actively networked with emerging startups, gaining exposure to cutting-edge innovations and disruptive technologies in AI and cyber defense. These interactions opened new avenues for collaboration and learning.\n\nEvents like APDTS serve as a catalyst for personal and professional growth. For Gowtham, it was more than just a summit—it was a launchpad for future innovation, meaningful connections, and continuous learning. The experience has ignited an even stronger commitment to staying at the forefront of digital technology and applying these insights in real-world challenges.",
    "images": [
      "/blog6-2.jpeg",
      "/blog6-1.jpeg",
      
      "/blog6-3.jpeg"
    ],
    "author": "M Gowtham Satya Sai",
    "date": "2025-01-08"
  }
  

]