[
  {
    "id": "1",
    "title": "FTP Vulnerability",
    "description": "Cyber Crew team exploited anonymous FTP login on kietgroup.info, exposing sensitive data",
    "content": "Our Cyber Crew team, led by Ajay, uncovered a critical FTP vulnerability on kietgroup.info, where anonymous login granted access to faculty and student information, plus confidential documents. This discovery highlights the risks of misconfigured FTP servers, including data leaks and potential misuse. Below are Cyber Crew members who contributed to or learned from this finding, showcasing our collaborative effort in cybersecurity research: **Daniel**, **Arshith**, **Gowtham**, **Pradeep**, **Harsha**, **Chakresh**, **Sai**.\nThis vulnerability exposed personal and institutional data, emphasizing the need for secure authentication. We recommend disabling anonymous access, enforcing strong credentials, and auditing server configurations.",
    "images": ["/ftp.png", "/ftp2.png"],
    "students": [
      { "name": "Daniel", "photo": "./Daniel.jpg" },
      { "name": "Arshith", "photo": "./Arshith.jpg" },
      { "name": "Vasu", "photo": "./vasu.jpg" },
      { "name": "Gowtham", "photo": "./Gowtham.jpg" },
      { "name": "Pradeep", "photo": "./Pradeep.jpg" },
      { "name": "Harsha", "photo": "./Harsha.jpg" },
      { "name": "Chakresh", "photo": "./chakresh.png" },
      { "name": "Sai", "photo": "./sai.jpg" }
    ],
    "date": "2025-02-10"
  },
  {
    "id": "2",
    "title": "Information Disclosure",
    "description": "Cyber Crew team's discovery of an information disclosure vulnerability, where sensitive or private data was unintentionally exposed.",
    "content": "Our Cyber Crew team, led by **Gowtham**, uncovered a critical information disclosure vulnerability in the kietgroup.info web application. This flaw resulted in the unintentional exposure of sensitive faculty, student, and institutional documents, posing serious risks to data privacy and security.\n\nInformation disclosure vulnerabilities commonly occur due to application errors, debug messages, or misconfigured systems. In this case, the web server was leaking internal information that should not have been publicly accessible, potentially allowing unauthorized access to confidential data.\n\nThis finding underscores the importance of strong application security practices, including proper access control, removal of verbose error messages in production, and regular security audits.\n\nBelow are Cyber Crew members who contributed to this research and strengthened our collaborative efforts in cybersecurity investigation: **Daniel**, **Arshith**, **Gowtham**, **Pradeep**, **Harsha**, **Chakresh**, **Sai**,**Priya**. Together, we aim to promote cybersecurity awareness and mitigate risks within our digital ecosystem",
    "images": ["/info1.png", "/info2.png"],
    "students": [
      { "name": "Daniel", "photo": "./Daniel.jpg" },
      { "name": "Arshith", "photo": "./Arshith.jpg" },
      { "name": "Pradeep", "photo": "./Pradeep.jpg" },
      { "name": "Harsha", "photo": "./Harsha.jpg" },
      { "name": "Chakresh", "photo": "./chakresh.png" },
      { "name": "Sai", "photo": "./sai.jpg" },
      { "name": "Gowtham", "photo": "./Gowtham.jpg" },
      { "name": "Priya", "photo": "./priya.jpg" }
      
    ],
    "date": "2025-02-10"
  },
  {
    "id": "3",
    "title": "Price Tampering",
    "description": "A critical price tampering vulnerability was discovered on the college website by Cyber Crew member K Durga Srinivas.",
    "content": "Our Cyber Crew member, **K Durga Srinivas**, uncovered a serious **price tampering vulnerability** in the college website. This flaw allowed users to manipulate the price values of online services or products offered through the website by intercepting and modifying data being sent to the server.\n\nPrice tampering occurs when client-side validations are relied upon instead of proper server-side checks. Attackers can exploit this by using browser developer tools or intercepting network requests to change prices before submission.\n\nThis vulnerability could lead to unauthorized discounts, free access to paid services, or financial losses for the institution. It highlights the importance of implementing strict **server-side validation** and integrity checks on all sensitive transactions.\n\nWe recommend the following mitigations:\n- Never trust client-side inputs for pricing or payment logic\n- Implement secure server-side validation and verification\n- Use encrypted communication channels (HTTPS) and monitor for abnormal patterns\n\nThis discovery further showcases the importance of web application security and the proactive efforts of our Cyber Crew in identifying and reporting such issues",
    "images": ["/price1.jpg", "/price2.jpg"],
    "students": [
      { "name": "K Durga Srinivas",  "photo": "./vasu.jpg" }
    ],
    "date": "2025-02-12"
  }
]